## Scratch: network
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 53 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.vpc_flow_logs_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "vpc_flow_logs_policy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:DescribeLogGroups",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # data.aws_subnet_ids.ecr_endpoint_available will be read during apply
  # (config refers to values not yet known)
 <= data "aws_subnet_ids" "ecr_endpoint_available"  {
      + id     = (known after apply)
      + ids    = (known after apply)
      + tags   = (known after apply)
      + vpc_id = (known after apply)

      + filter {
          + name   = "availability-zone"
          + values = [
              + "ca-central-1a",
              + "ca-central-1b",
            ]
        }
      + filter {
          + name   = "tag:Access"
          + values = [
              + "private",
            ]
        }
    }

  # data.aws_subnet_ids.lambda_endpoint_available will be read during apply
  # (config refers to values not yet known)
 <= data "aws_subnet_ids" "lambda_endpoint_available"  {
      + id     = (known after apply)
      + ids    = (known after apply)
      + tags   = (known after apply)
      + vpc_id = (known after apply)

      + filter {
          + name   = "availability-zone"
          + values = [
              + "ca-central-1a",
              + "ca-central-1b",
            ]
        }
      + filter {
          + name   = "tag:Access"
          + values = [
              + "private",
            ]
        }
    }

  # aws_cloudwatch_log_group.vpc_flow_logs will be created
  + resource "aws_cloudwatch_log_group" "vpc_flow_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:722713121070:key/d5d2549a-0261-47ae-9a63-5f77193098b1"
      + name              = "vpc_flow_logs"
      + retention_in_days = 30
      + tags_all          = (known after apply)
    }

  # aws_default_network_acl.forms will be created
  + resource "aws_default_network_acl" "forms" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 400
          + to_port    = 0
        }

      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 300
          + to_port    = 0
        }
      + ingress {
          + action     = "deny"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 22
          + protocol   = "tcp"
          + rule_no    = 100
          + to_port    = 22
        }
      + ingress {
          + action     = "deny"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 3389
          + protocol   = "tcp"
          + rule_no    = 200
          + to_port    = 3389
        }
    }

  # aws_default_security_group.default will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_eip.forms_natgw[0] will be created
  + resource "aws_eip" "forms_natgw" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "forms NAT GW 0"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "forms NAT GW 0"
          + "Terraform"  = "true"
        }
      + vpc                  = true
    }

  # aws_eip.forms_natgw[1] will be created
  + resource "aws_eip" "forms_natgw" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "forms NAT GW 1"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "forms NAT GW 1"
          + "Terraform"  = "true"
        }
      + vpc                  = true
    }

  # aws_eip.forms_natgw[2] will be created
  + resource "aws_eip" "forms_natgw" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "forms NAT GW 2"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "forms NAT GW 2"
          + "Terraform"  = "true"
        }
      + vpc                  = true
    }

  # aws_flow_log.vpc_flow_logs will be created
  + resource "aws_flow_log" "vpc_flow_logs" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags_all                 = (known after apply)
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # aws_iam_role.vpc_flow_logs will be created
  + resource "aws_iam_role" "vpc_flow_logs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "vpc_flow_logs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy.vpc_flow_logs will be created
  + resource "aws_iam_role_policy" "vpc_flow_logs" {
      + id     = (known after apply)
      + name   = "vpc_flow_logs"
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # aws_internet_gateway.forms will be created
  + resource "aws_internet_gateway" "forms" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "forms"
          + "Terraform"  = "true"
        }
      + tags_all = {
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "forms"
          + "Terraform"  = "true"
        }
      + vpc_id   = (known after apply)
    }

  # aws_nat_gateway.forms[0] will be created
  + resource "aws_nat_gateway" "forms" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "forms NAT GW"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "forms NAT GW"
          + "Terraform"  = "true"
        }
    }

  # aws_nat_gateway.forms[1] will be created
  + resource "aws_nat_gateway" "forms" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "forms NAT GW"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "forms NAT GW"
          + "Terraform"  = "true"
        }
    }

  # aws_nat_gateway.forms[2] will be created
  + resource "aws_nat_gateway" "forms" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "forms NAT GW"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "forms NAT GW"
          + "Terraform"  = "true"
        }
    }

  # aws_route_table.forms_private_subnet[0] will be created
  + resource "aws_route_table" "forms_private_subnet" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "Private Subnet Route Table 0"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "Private Subnet Route Table 0"
          + "Terraform"  = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.forms_private_subnet[1] will be created
  + resource "aws_route_table" "forms_private_subnet" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "Private Subnet Route Table 1"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "Private Subnet Route Table 1"
          + "Terraform"  = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.forms_private_subnet[2] will be created
  + resource "aws_route_table" "forms_private_subnet" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "Private Subnet Route Table 2"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "Private Subnet Route Table 2"
          + "Terraform"  = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.forms_public_subnet will be created
  + resource "aws_route_table" "forms_public_subnet" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "Public Subnet Route Table"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "Public Subnet Route Table"
          + "Terraform"  = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.forms[0] will be created
  + resource "aws_route_table_association" "forms" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.forms[1] will be created
  + resource "aws_route_table_association" "forms" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.forms[2] will be created
  + resource "aws_route_table_association" "forms" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.forms_private_route[0] will be created
  + resource "aws_route_table_association" "forms_private_route" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.forms_private_route[1] will be created
  + resource "aws_route_table_association" "forms_private_route" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.forms_private_route[2] will be created
  + resource "aws_route_table_association" "forms_private_route" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.forms will be created
  + resource "aws_security_group" "forms" {
      + arn                    = (known after apply)
      + description            = "Ingress - Forms"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "forms"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.forms_database will be created
  + resource "aws_security_group" "forms_database" {
      + arn                    = (known after apply)
      + description            = "Ingress - Forms Database"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 5432
            },
        ]
      + name                   = "forms-database"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.forms_egress will be created
  + resource "aws_security_group" "forms_egress" {
      + arn                    = (known after apply)
      + description            = "Egress - Forms External Services"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "egress-anywhere"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.forms_load_balancer will be created
  + resource "aws_security_group" "forms_load_balancer" {
      + arn                    = (known after apply)
      + description            = "Ingress - forms Load Balancer"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "172.16.0.0/16",
                ]
              + description      = ""
              + from_port        = 3000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3000
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "forms-load-balancer"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.forms_redis will be created
  + resource "aws_security_group" "forms_redis" {
      + arn                    = (known after apply)
      + description            = "Ingress - Forms Redis"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 6379
            },
        ]
      + name                   = "forms-redis"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.privatelink will be created
  + resource "aws_security_group" "privatelink" {
      + arn                    = (known after apply)
      + description            = "privatelink endpoints"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "privatelink"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + tags_all               = {
          + "CostCentre" = "forms-platform-scratch"
          + "Terraform"  = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.forms_egress_database will be created
  + resource "aws_security_group_rule" "forms_egress_database" {
      + description              = "Security group rule for Forms DB egress to Database"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "egress"
    }

  # aws_security_group_rule.forms_egress_notify will be created
  + resource "aws_security_group_rule" "forms_egress_notify" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Security group rule for Forms Notify egress"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.forms_egress_privatelink will be created
  + resource "aws_security_group_rule" "forms_egress_privatelink" {
      + description              = "Security group rule for Forms egress through privatelink"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # aws_security_group_rule.forms_egress_redis will be created
  + resource "aws_security_group_rule" "forms_egress_redis" {
      + description              = "Security group rule for Forms DB egress to Redis"
      + from_port                = 6379
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 6379
      + type                     = "egress"
    }

  # aws_security_group_rule.forms_ingress_alb will be created
  + resource "aws_security_group_rule" "forms_ingress_alb" {
      + description              = "Security group rule for Forms Ingress ALB"
      + from_port                = 3000
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3000
      + type                     = "ingress"
    }

  # aws_security_group_rule.privatelink_forms_ingress will be created
  + resource "aws_security_group_rule" "privatelink_forms_ingress" {
      + description              = "Security group rule for Forms ingress"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_subnet.forms_private[0] will be created
  + resource "aws_subnet" "forms_private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ca-central-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "172.16.0.0/20"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Access"     = "private"
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "Private Subnet 01"
          + "Terraform"  = "true"
        }
      + tags_all                        = {
          + "Access"     = "private"
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "Private Subnet 01"
          + "Terraform"  = "true"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_subnet.forms_private[1] will be created
  + resource "aws_subnet" "forms_private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ca-central-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "172.16.16.0/20"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Access"     = "private"
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "Private Subnet 02"
          + "Terraform"  = "true"
        }
      + tags_all                        = {
          + "Access"     = "private"
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "Private Subnet 02"
          + "Terraform"  = "true"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_subnet.forms_private[2] will be created
  + resource "aws_subnet" "forms_private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ca-central-1d"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "172.16.32.0/20"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Access"     = "private"
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "Private Subnet 03"
          + "Terraform"  = "true"
        }
      + tags_all                        = {
          + "Access"     = "private"
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "Private Subnet 03"
          + "Terraform"  = "true"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_subnet.forms_public[0] will be created
  + resource "aws_subnet" "forms_public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ca-central-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "172.16.48.0/20"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Access"     = "public"
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "Public Subnet 01"
          + "Terraform"  = "true"
        }
      + tags_all                        = {
          + "Access"     = "public"
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "Public Subnet 01"
          + "Terraform"  = "true"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_subnet.forms_public[1] will be created
  + resource "aws_subnet" "forms_public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ca-central-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "172.16.64.0/20"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Access"     = "public"
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "Public Subnet 02"
          + "Terraform"  = "true"
        }
      + tags_all                        = {
          + "Access"     = "public"
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "Public Subnet 02"
          + "Terraform"  = "true"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_subnet.forms_public[2] will be created
  + resource "aws_subnet" "forms_public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ca-central-1d"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "172.16.80.0/20"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Access"     = "public"
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "Public Subnet 03"
          + "Terraform"  = "true"
        }
      + tags_all                        = {
          + "Access"     = "public"
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "Public Subnet 03"
          + "Terraform"  = "true"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_vpc.forms will be created
  + resource "aws_vpc" "forms" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "172.16.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "forms"
          + "Terraform"  = "true"
        }
      + tags_all                         = {
          + "CostCentre" = "forms-platform-scratch"
          + "Name"       = "forms"
          + "Terraform"  = "true"
        }
    }

  # aws_vpc_endpoint.dynamodb will be created
  + resource "aws_vpc_endpoint" "dynamodb" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.dynamodb"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)
    }

  # aws_vpc_endpoint.ecr-api will be created
  + resource "aws_vpc_endpoint" "ecr-api" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.ecr.api"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)
    }

  # aws_vpc_endpoint.ecr-dkr will be created
  + resource "aws_vpc_endpoint" "ecr-dkr" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.ecr.dkr"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)
    }

  # aws_vpc_endpoint.kms will be created
  + resource "aws_vpc_endpoint" "kms" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.kms"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)
    }

  # aws_vpc_endpoint.lambda will be created
  + resource "aws_vpc_endpoint" "lambda" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.lambda"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)
    }

  # aws_vpc_endpoint.logs will be created
  + resource "aws_vpc_endpoint" "logs" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.logs"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)
    }

  # aws_vpc_endpoint.monitoring will be created
  + resource "aws_vpc_endpoint" "monitoring" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.monitoring"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)
    }

  # aws_vpc_endpoint.rds will be created
  + resource "aws_vpc_endpoint" "rds" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.rds-data"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)
    }

  # aws_vpc_endpoint.s3 will be created
  + resource "aws_vpc_endpoint" "s3" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)
    }

  # aws_vpc_endpoint.secretsmanager will be created
  + resource "aws_vpc_endpoint" "secretsmanager" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.secretsmanager"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)
    }

  # aws_vpc_endpoint.sqs will be created
  + resource "aws_vpc_endpoint" "sqs" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ca-central-1.sqs"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)
    }

Plan: 53 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + alb_security_group_id    = (known after apply)
  + ecs_security_group_id    = (known after apply)
  + egress_security_group_id = (known after apply)
  + private_subnet_ids       = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_subnet_ids        = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + rds_security_group_id    = (known after apply)
  + redis_security_group_id  = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.vpc_flow_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_default_security_group.default"]
WARN - plan.json - main - Missing Common Tags: ["aws_flow_log.vpc_flow_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.vpc_flow_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.dynamodb"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.ecr-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.ecr-dkr"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.kms"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.monitoring"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.secretsmanager"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.sqs"]

23 tests, 8 passed, 15 warnings, 0 failures, 0 exceptions

```

</details>
